InformationRegisters/Сооб_Сообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>Сооб_Сообщения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сообщение</Name>
					<Comment>Текст сообщения (напоминания)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПервогоПолучения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПервогоПросмотра</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПереадресации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПометкиНаУдаление</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаМожноУдалять</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Переправил</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокПереадресации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МожноУдалять</Name>
					<Comment>Контроль исполнения автором</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Обсуждение авторм и получателем</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выполнено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПометитьНаУдаление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОбъектСообщений</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВременноНеУдалять</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КтоЗаблокировал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Получатель</Name>
					<Comment>Получатель сообщения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Автор</Name>
					<Comment>Автор сообщения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗапланированнаяДатаДоставки</Name>
					<Comment>Когда показать сообщение (напоминание)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСообщения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Сооб_ТипСообщения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Сооб_Категория</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УникИдент</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/Сооб_ТипСообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>Сооб_ТипСообщения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Сообщение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Напоминание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поручение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/Сооб_Сообщения/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Запись.ИсходныйКлючЗаписи.Пустой() Тогда
		//НОВАЯ
		
		//Запись.Автор = Пользователи.ТекущийПользователь();
		Запись.Автор = ПараметрыСеанса.Пользователь;
		Запись.ЗапланированнаяДатаДоставки = ТекущаяДата();
		Запись.УникИдент = Новый УникальныйИдентификатор; 
		
	КонецЕсли;
	
	// © Primus1C  10.09.2023  НАЧАЛО ►
	Сп = Элементы.Получатель.СписокВыбора;
    Сп.Очистить();
	Запр = Новый Запрос;
	Запр.Текст = "ВЫБРАТЬ
	             |	Пользователи.Ссылка,
	             |	Пользователи.Наименование
	             |ИЗ
	             |	Справочник.Пользователи КАК Пользователи
	             |ГДЕ
	             |	НЕ Пользователи.ПометкаУдаления
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	Пользователи.Наименование";  
	Выборка = Запр.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл            
		Если Сооб_Сервер.ПроверитьНаличиеРоли(Выборка.Ссылка) Тогда
			Сп.Добавить(Выборка.Ссылка, Выборка.Наименование);
		КонецЕсли;
	КонецЦикла;  
	
	Сп = Элементы.ТипСообщения.СписокВыбора;
	Сп.Очистить();
	Сп.Добавить(Перечисления.Сооб_ТипСообщения.Напоминание,,,БиблиотекаКартинок.СообщениеЗеленое16);
	Сп.Добавить(Перечисления.Сооб_ТипСообщения.Сообщение,,,БиблиотекаКартинок.СообщениеСинее16);
	Сп.Добавить(Перечисления.Сооб_ТипСообщения.Поручение,,,БиблиотекаКартинок.СообщениеКрасное16);  
	
	Если НЕ РольДоступна("Сооб_АдминистраторСообщений") Тогда
	
		
	
	КонецЕсли; 
	
	// © Primus1C  ОКОНЧАНИЕ ◄

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьДоступностьРеквизитов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Запись.Автор = гоПользователь() И Запись.ДатаСоздания = Сооб_Сервер.ПустаяДата() Тогда
		
		Запись.ДатаСоздания = ТекущаяДата();
		Запись.ДатаПервогоПолучения = Запись.ЗапланированнаяДатаДоставки;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьРеквизитов()
	
	// © Primus1C  10.09.2023  НАЧАЛО ►
	Элементы.ГруппаВыполнение.Видимость = Запись.ТипСообщения = ПредопределенноеЗначение("Перечисление.Сооб_ТипСообщения.Поручение");
	// © Primus1C  ОКОНЧАНИЕ ◄
	
	Если ЗначениеЗаполнено(Запись.ДатаСоздания) Тогда
		
		Элементы.Получатель.ТолькоПросмотр = Истина;
		Элементы.ЗапланированнаяДатаДоставки.ТолькоПросмотр = Истина;
		Элементы.Категория.ТолькоПросмотр = Истина;
		Элементы.ТипСообщения.ТолькоПросмотр = Истина;
		Элементы.Тема.ТолькоПросмотр = Истина;
		Элементы.Сообщение.ТолькоПросмотр = Истина;
		Элементы.СсылкаНаОбъект.ТолькоПросмотр = Истина;
		
	КонецЕсли;
	
	Если Запись.Получатель = гоПользователь() Тогда
		
		Элементы.ПометитьНаУдаление.ТолькоПросмотр = ЛОЖЬ;
		
		Если (НЕ ЗначениеЗаполнено(Запись.ДатаВыполнения))
			И ЭтоПоручение() Тогда 
			Элементы.Выполнено.ТолькоПросмотр = Ложь;
		Иначе
			Элементы.Выполнено.ТолькоПросмотр = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Запись.Автор = гоПользователь() Тогда
		
		Элементы.МожноУдалять.ТолькоПросмотр = ЛОЖЬ;
		
	КонецЕсли;
	
	Если (ЗначениеЗаполнено(Запись.КтоЗаблокировал)) И (Запись.КтоЗаблокировал = гоПользователь()) Тогда
		
		Элементы.ВременноНеУдалять.ТолькоПросмотр = ЛОЖЬ;
		
	ИначеЕсли НЕ ЗначениеЗаполнено(Запись.КтоЗаблокировал) Тогда
		
		Элементы.ВременноНеУдалять.ТолькоПросмотр = ЛОЖЬ;
		
	Иначе
		
		Элементы.ВременноНеУдалять.ТолькоПросмотр = ИСТИНА;
		
	КонецЕсли;
	
	Если ЭтоНапоминание() тогда
		
		Элементы.Получатель.ТолькоПросмотр = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЭтоПоручение()
	
	Если Запись.ТипСообщения = Перечисления.Сооб_ТипСообщения.Поручение Тогда
		
		Возврат Истина;
		
	Иначе
		
		Возврат ЛОЖЬ;
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ЭтоНапоминание()
	
	Если Запись.ТипСообщения = Перечисления.Сооб_ТипСообщения.Напоминание Тогда
		
		Возврат Истина;
		
	Иначе
		
		Возврат ЛОЖЬ;
		
	КонецЕсли;
	
КонецФункции


&НаКлиенте
Процедура ВыполненоПриИзменении(Элемент)
	
	Если (Запись.Выполнено) И (Запись.ДатаВыполнения = Сооб_Сервер.ПустаяДата()) Тогда     
		
		Запись.ДатаВыполнения = ТекущаяДата();
		
		ЭтаФорма.Записать();
		ЭтаФорма.ОбновитьОтображениеДанных();
		
		УстановитьДоступностьРеквизитов();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипСообщенияПриИзменении(Элемент)
	
	Если ЭтоНапоминание() Тогда
		
		Запись.Получатель = гоПользователь();
		
	КонецЕсли;
	
	УстановитьДоступностьРеквизитов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучательПриИзменении(Элемент)
	
	Если НЕ Сооб_Сервер.ПроверитьНаличиеРоли(Запись.Получатель) Тогда
		
		Запись.Получатель = Сооб_Сервер.ПустойПользователь();
		
		СообщПольз = Новый СообщениеПользователю;
		СообщПольз.Текст = НСтр("ru = 'Пользователь не подключен к подсистеме ""Сообщения""'; en = 'The user is not connected to the subsystem ""Messages""'");
		СообщПольз.ПутьКДанным = "Запись.Получатель";
		СообщПольз.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКомментарий(Команда)
	
	ТекстКом = Запись.Комментарий;
	
	Запись.Комментарий = "";
	
	Если СокрЛП(ТекстКом) = "" Тогда
		Запись.Комментарий = СокрЛП(гоПользователь())+" "+Формат(ТекущаяДата(), "ДФ='dd.MM.yyyy HH:MM:ss'")+" >>> ";
	Иначе
		Запись.Комментарий = ТекстКом + "
		|******************************"+ "
		|"+ СокрЛП(гоПользователь())+" "+Формат(ТекущаяДата(), "ДФ='dd.MM.yyyy HH:MM:ss'")+" >>> ";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МожноУдалятьПриИзменении(Элемент)
	
	Если Запись.МожноУдалять Тогда     
		
		Запись.ДатаМожноУдалять = ТекущаяДата();
		
	Иначе
		
		Запись.ДатаМожноУдалять = Сооб_Сервер.ПустаяДата();
		
	КонецЕсли;
	
	ЭтаФорма.Записать();
	ЭтаФорма.ОбновитьОтображениеДанных();
	
	УстановитьДоступностьРеквизитов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПометитьНаУдалениеПриИзменении(Элемент)
	
	Если Запись.ПометитьНаУдаление Тогда     
		
		Запись.ДатаПометкиНаУдаление = ТекущаяДата();
		
	Иначе
		
		Запись.ДатаПометкиНаУдаление = Сооб_Сервер.ПустаяДата();
		
	КонецЕсли;
	
	ЭтаФорма.Записать();
	ЭтаФорма.ОбновитьОтображениеДанных();
	
	УстановитьДоступностьРеквизитов();
	
КонецПроцедуры

&НаКлиенте
Процедура ВременноНеУдалятьПриИзменении(Элемент)
	
	Если Запись.ВременноНеУдалять Тогда     
		
		Запись.КтоЗаблокировал = гоПользователь();
		
	Иначе
		
		Запись.КтоЗаблокировал = Сооб_Сервер.ПустойПользователь();
		
	КонецЕсли;
	
	ЭтаФорма.Записать();
	ЭтаФорма.ОбновитьОтображениеДанных();
	
	УстановитьДоступностьРеквизитов();
	
КонецПроцедуры

// © Primus1C  10.09.2023  НАЧАЛО ►

&НаКлиенте
Процедура ПолучательНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)


КонецПроцедуры

// © Primus1C  ОКОНЧАНИЕ ◄
